/**
 * Напиши скрипт перевірки підписки користувача при доступі до контента
 * - Є три типи підписки: free, pro і vip.
 * - Отримати доступ можуть тільки користувачі pro та vip
 */

const sub = "free";

/**
 * Напиши скрипт, який перевіряє можливість відкрити чат з користувачем.
 * Для цього, користувач має бути:
 * - другом
 * - онлайн
 * - без режима не турбувати
 */

const isOnline = true;
const isFriend = true;
const isDenied = true;

// const canOpenChat = ;
// console.log("Можна відкрити чат? ", canOpenChat);
